In [1]:
! pip install sqlalchemy
! pip install pymysql

Requirement already satisfied: sqlalchemy in c:\users\glorialagrand\anaconda3-\lib\site-packages (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\glorialagrand\anaconda3-\lib\site-packages (from sqlalchemy) (2.0.1)
Requirement already satisfied: pymysql in c:\users\glorialagrand\anaconda3-\lib\site-packages (1.1.0)

In [2]:
import pandas as pd
from sqlalchemy import create_engine 
import pymysql.cursors
import os
import getpass
import urllib.parse

In [3]:
urllib.parse.quote_plus('!')

'%21'

In [4]:
urllib.parse.quote_plus('é')

'%C3%A9'

In [5]:
pw_raw = 'Glojai29ans!' #os.getenv('mysql_andy')
pw = urllib.parse.quote_plus(pw_raw)

In [6]:
#engine = sqlalchemy.create_engine(f"mysql://{username}:{password}@{host}:{port}")

connection_string = 'mysql+pymysql://root:' + pw + '@localhost:3306/sakila'
engine = create_engine(connection_string)

In [12]:
def rentals_month(engine,month,year):
    sql = f"""
    select *
    from sakila
    where year(rental_date) = {year}
    where month(rental_date) = {month} """
    return read_my_sql_query(sql,engine)

df = rentals_month(engine, 5, 2005)

NameError: name 'read_my_sql_query' is not defined

In [13]:
df = pd.DataFrame()

In [9]:
df

NameError: name 'df' is not defined

In [12]:
df.to_sq

3

In [46]:
sql = """
select *
"""

In [49]:
new_df = pd.read_sql_query(sql, engine)
new_df

     customerNumber checkNumber paymentDate    amount
0               103    HQ336336  2004-10-19   6066.78
1               103    JM555205  2003-06-05  14571.44
2               103    OM314933  2004-12-18   1676.14
3               112    BO864823  2004-12-17  14191.12
4               112     HQ55022  2003-06-06  32641.98
..              ...         ...         ...       ...
268             495    BH167026  2003-12-26  59265.14
269             495    FN155234  2004-05-14   6276.60
270             496    EU531600  2005-05-25  30253.75
271             496    MB342426  2003-07-16  32077.44
272             496     MN89921  2004-12-31  52166.00

[273 rows x 4 columns]

In [50]:
new_df2 = pd.read_sql_table('payments',engine,'classicmodels')

In [51]:
new_df2

     customerNumber checkNumber paymentDate    amount
0               103    HQ336336  2004-10-19   6066.78
1               103    JM555205  2003-06-05  14571.44
2               103    OM314933  2004-12-18   1676.14
3               112    BO864823  2004-12-17  14191.12
4               112     HQ55022  2003-06-06  32641.98
..              ...         ...         ...       ...
268             495    BH167026  2003-12-26  59265.14
269             495    FN155234  2004-05-14   6276.60
270             496    EU531600  2005-05-25  30253.75
271             496    MB342426  2003-07-16  32077.44
272             496     MN89921  2004-12-31  52166.00

[273 rows x 4 columns]